Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `OidcWiremockTestResource` can be used to emulate all OpenID Connect providers.
ja_jp: `OidcWiremockTestResource` は、すべての OpenID Connect プロバイダーをエミュレートするために使用することができます。

source: `OidcWiremockTestResource` does not work with `@QuarkusIntegrationTest` against Docker containers because the WireMock server runs in the JVM that runs the test, which is inaccessible from the Docker container that runs the Quarkus application.
ja_jp: `OidcWiremockTestResource` は、Docker コンテナーに対する `@QuarkusIntegrationTest` では機能しません。WireMock サーバーが、テストを実行する JVM で実行されるためです。その JVM には、Quarkus アプリケーションを実行する Docker コンテナーからはアクセスできません。

source: `OidcWiremockTestResource` does not work with `@QuarkusIntegrationTest` against Docker containers, because the Wiremock server is running in the JVM running the test, which cannot be accessed from the Docker container running the Quarkus application.
ja_jp: Wiremock サーバーはテストを実行している JVM で実行されており、Quarkus アプリケーションを実行している Docker コンテナーからはアクセスできないため、 `OidcWiremockTestResource` は Docker コンテナーに対して `@QuarkusIntegrationTest` では機能しません。

source: `OidcWiremockTestResource` recognizes `alice` and `admin` users. The user `alice` has the `user` role only by default - it can be customized with a `quarkus.test.oidc.token.user-roles` system property. The user `admin` has the `user` and `admin` roles by default - it can be customized with a `quarkus.test.oidc.token.admin-roles` system property.
ja_jp: `OidcWiremockTestResource` は `alice` と `admin` ユーザーを認識します。ユーザー `alice` にはデフォルトで `user` ロールしかありませんが、 `quarkus.test.oidc.token.user-roles` システムプロパティーでカスタマイズできます。ユーザー `admin` にはデフォルトで `user` と `admin` ロールがありますが、 `quarkus.test.oidc.token.user-roles` システムプロパティーでカスタマイズできます。

source: `OnTextMessage` and `OnBinaryMessage` methods can also specify which codec should be used explicitly:
ja_jp: `OnTextMessage` メソッドと `OnBinaryMessage` メソッドでは、どのコーデックを使用するかを明示的に指定することもできます。

source: `OnTextMessage` are invoked for every _text_ message received from the client. `OnBinaryMessage` are invoked for every _binary_ message the client receives.
ja_jp: `OnTextMessage` は、クライアントから受信されるすべての _テキスト_ メッセージに対して呼び出されます。 `OnBinaryMessage` は、クライアントが受信するすべての _バイナリー_ メッセージに対して呼び出されます。

source: `OpenClientConnections#listAll()` returns an immutable snapshot of all open connections at the given time.
ja_jp: `OpenClientConnections#listAll()` は、指定された時点で開いているすべての接続のイミュータブルなスナップショットを返します。

source: `OpenConnections#listAll()` returns an immutable snapshot of all open connections at the given time.
ja_jp: `OpenConnections#listAll()` は、指定された時点で開いているすべての接続のイミュータブルなスナップショットを返します。

source: `Optional<MetricsCapabilityBuildItem> metricsCapability` can be used in the build step to selectively control initialization of beans or the production of other build items. The Jaeger extension, for example, can use the following to control initialization of specialized Metrics API adapters:
ja_jp: `Optional<MetricsCapabilityBuildItem> metricsCapability` をビルドステップで使用して、Bean の初期化または他のビルドアイテムの生成を選択的に制御できます。たとえば Jaeger エクステンションは、以下を使用して、特殊なメトリクス API アダプターの初期化を制御できます。

source: `OutgoingKafkaRecordMetadata` allows to set metadata attributes of the Kafka record, such as `key`, `topic`, `partition` or `timestamp`. One use case is to dynamically select the destination topic of a message. In this case, instead of configuring the topic inside your application configuration file, you need to use the outgoing metadata to set the name of the topic.
ja_jp: `OutgoingKafkaRecordMetadata` を使用すると、Kafka レコードのメタデータ属性 (`key`、 `topic`、 `partition`、 `timestamp` など) を設定できます。1 つの使用例は、メッセージの宛先トピックを動的に選択することです。この場合、アプリケーション設定ファイル内でトピックを設定する代わりに、送信メタデータを使用してトピックの名前を設定する必要があります。

source: `POST /fruits` - creates a new entity.
ja_jp: `POST /fruits` - 新しいエンティティを作成します。

source: `POST /q/webauthn/callback`: Trigger a login
ja_jp: `POST /q/webauthn/callback` :ログインをトリガーします

source: `POST /q/webauthn/callback`: Trigger a registration
ja_jp: `POST /q/webauthn/callback` :登録をトリガーします

source: `POST /q/webauthn/login`: Set up and obtain a login challenge
ja_jp: `POST /q/webauthn/login` :ログインチャレンジのセットアップと取得

source: `POST /q/webauthn/register?username=<username>`: Trigger a registration
ja_jp: `POST /q/webauthn/register?username=<username>`: 登録をトリガーする

source: `POST /q/webauthn/register`: Set up and obtain a registration challenge
ja_jp: `POST /q/webauthn/register` :登録チャレンジの設定と取得

source: `PSAMS` is one of the many cache implementation classes of Caffeine so this part may vary.
ja_jp: `PSAMS` は、Caffeineの数あるキャッシュ実装クラスのひとつなので、この部分は変わるかもしれません。

source: `PUT /fruits/:id` - updates an existing entity or creates a new one with a specified ID (if allowed by the entity definition).
ja_jp: `PUT /fruits/:id` - 既存のエンティティを更新するか、指定されたIDで新しいエンティティを作成します（エンティティ定義で許可されている場合）。

source: `PUT /public/foo`, on the other hand, will not match the method permissions of `permit1`, so `deny1` will be activated and reject the request.
ja_jp: 一方、 `PUT /public/foo` `permit1` のメソッドパーミッションと一致しないため、 `deny1` が有効化され、リクエストが拒否されます。

source: `PanacheQuery` also allows range-based queries.
ja_jp: `PanacheQuery` では、レンジベースのクエリーも使用できます。

source: `PicocliCommandLineFactory` will create an instance of CommandLine with `TopCommand` and `CommandLine.IFactory` injected.
ja_jp: `PicocliCommandLineFactory` は、 `TopCommand` と `CommandLine.IFactory` を注入した CommandLine のインスタンスを作成します。

source: `Previous incidents?` (InputData element, of type `boolean`)
ja_jp: `Previous incidents?` （InputData要素 、 `boolean` 型）

source: `Priority` enables the interceptor and affects the interceptor ordering. Interceptors with smaller priority values are called first.
ja_jp: `Priority` はインターセプターを有効にし、インターセプターの順序に影響を与えます。優先度の値が小さいインターセプターが最初に呼び出されます。

source: `Procfile` to configure how Heroku starts your application
ja_jp: Herokuがアプリケーションを開始する方法を設定するために `Procfile`

source: `ProtecedResource` has 2 endpoints:
ja_jp: `ProtecedResource` には 2 つのエンドポイントがあります。

source: `ProtectedResource` has two endpoints:
ja_jp: `ProtectedResource` には 2 つのエンドポイントがあります。

source: `ProtectedResource` returns a name from both `userName()` and `adminName()` methods. The name is extracted from the current `JsonWebToken`.
ja_jp: `ProtectedResource` は `userName()` と `adminName()` の両方のメソッドから名前を返します。この名前は、現在の `JsonWebToken` から抽出されたものです。

source: `Publisher` (from Reactive-Streams)
ja_jp: `Publisher` (Reactive-Streamsから)

source: `QUARKUS_REGISTRIES` environment variable can be used to specify which registries should be enabled as a comma-separated list of registry IDs. For example
ja_jp: `QUARKUS_REGISTRIES` 環境変数を使用すると、有効にするレジストリーをコンマ区切りのレジストリー ID のリストとして指定できます。例えば

source: `QualifierRegistrarBuildItem` Example
ja_jp: `QualifierRegistrarBuildItem` の例

source: `Quarkus.run` also provides a version that allows the code to handle errors. For example:
ja_jp: `Quarkus.run` はコードがエラーを処理できるようにするバージョンも提供します。例:

source: `QuarkusComponentTestExtension` also resolves parameters of test methods and injects matching beans.
ja_jp: また、 `QuarkusComponentTestExtension` は、テストメソッドのパラメーターを解決し、一致する Bean を注入します。

source: `QuarkusTestResourceLifecycleManager` implementations can also implement `ContextAware` to get access to these properties, which allows you to set up the resource before Quarkus starts (e.g. configure a KeyCloak instance, add data to a database etc).
ja_jp: `QuarkusTestResourceLifecycleManager` 実装は、 `ContextAware` を実装してこれらのプロパティーにアクセスすることもできます。これにより、Quarkus が起動する前にリソースを設定できます (たとえば、KeyCloak インスタンスの設定、データベースへのデータの追加など)。

source: `QuarkusTestResourceLifecycleManager` implementations can also implement `ContextAware` to get access to these properties, which allows you to setup the resource before Quarkus starts (e.g. configure a KeyCloak instance, add data to a database etc).
ja_jp: `QuarkusTestResourceLifecycleManager` 実装は、 `ContextAware` を実装してこれらのプロパティーにアクセスすることもできます。これにより、Quarkus が起動する前にリソースを設定できます (たとえば、KeyCloak インスタンスの設定、データベースへのデータの追加など)。

source: `QwcHotReloadElement` extends `LitElement`, so your component is still a Lit Element.
ja_jp: `QwcHotReloadElement` は `LitElement` を拡張するため、コンポーネントは変わらず Lit Element です。

source: `REQUIRED` or `NOT_SUPPORTED` are probably the most useful ones. This is how you decide whether a method is to be running within or outside a transaction. Make sure to check the JavaDoc for the precise semantic.
ja_jp: `REQUIRED` や `NOT_SUPPORTED` が最も便利なものでしょう。これは、メソッドがトランザクション内で実行されるか、トランザクション外で実行されるかを決定する方法です。正確な意味については、必ずJavaDocを確認してください。

source: `RP-initiated` logout involves the logged-in user initiating a logout request by calling an application logout endpoint. Quarkus OIDC intercepts this request, clears the session cookie and redirects the user to the OIDC provider's logout endpoint.
ja_jp: `RP-initiated` ログアウトでは、ログイン中のユーザーがアプリケーションのログアウトエンドポイントを呼び出すことでログアウトリクエストを開始します。Quarkus OIDC はこのリクエストをインターセプトし、セッション Cookie をクリアして、ユーザーを OIDC プロバイダーのログアウトエンドポイントにリダイレクトします。

source: `RS256` is the default RSA private key signature algorithm.
ja_jp: `RS256` はデフォルトの RSA 秘密鍵署名アルゴリズムです。

source: `RSA-OAEP` is the default RSA public key encryption algorithm.
ja_jp: `RSA-OAEP` はデフォルトの RSA 公開鍵暗号化アルゴリズムです。

source: `RUNTIME_INIT` `SyntheticBeanBuildItem` Example
ja_jp: `RUNTIME_INIT` `SyntheticBeanBuildItem` の例

source: `ReactiveGreetingResource.kt` looks like this:
ja_jp: `ReactiveGreetingResource.kt` はこんな感じです。

source: `ReactiveGreetingResource` looks like this:
ja_jp: `ReactiveGreetingResource` は次のようになります:

source: `ReadStreams<T>` => can be consumed as `Multi<T>`
ja_jp: `ReadStreams<T>` ⇒消費することができます。 `Multi<T>`

source: `Record` is a simple wrapper around key and payload of the incoming Kafka record.
ja_jp: `Record` は、着信 Kafka レコードのキーとペイロードの単純なラッパーです。

source: `Remaining` (all non-explicitly list contexts)
ja_jp: `Remaining` (すべての非明示的にリスト化されたコンテキスト)

source: `RemoveBridgeMethodsClassVisitor` is a classic https://asm.ow2.io[ASM] `ClassVisitor` that will modify the bytecode:
ja_jp: `RemoveBridgeMethodsClassVisitor` は、バイトコードを修正する古典的な link:https://asm.ow2.io[ASM] `ClassVisitor` です。

source: `Request` representing the request the server parts accepts
ja_jp: サーバー部分が受け入れるリクエストを表す `Request`

source: `ResourceAnnotationBuildItem` Example
ja_jp: `ResourceAnnotationBuildItem` の例

source: `ResponseExceptionMapper` also defines the `getPriority` method which is used in order to determine the priority with which `ResponseExceptionMapper` implementations will be called (implementations with a lower value for `getPriority` will be invoked first). If `toThrowable` returns an exception, then that exception will be thrown. If `null` is returned, the next implementation of `ResponseExceptionMapper` in the chain will be called (if there is any).
ja_jp: `ResponseExceptionMapper` は、 `ResponseExceptionMapper` 実装が呼び出される優先度を決定するために使用される `getPriority` メソッドも定義します (`getPriority` の値が小さい実装が最初に呼び出されます)。 `toThrowable` が例外を返す場合、その例外が出力されます。 `null` が返された場合、チェーン内の `ResponseExceptionMapper` の次の実装が呼び出されます (存在する場合)。

source: `RestClientWithOidcClientFilter`, which uses an OIDC client filter provided by the `quarkus-rest-client-oidc-filter` extension to get and propagate an access token.
ja_jp: `RestClientWithOidcClientFilter`: これは、 `quarkus-rest-client-oidc-filter` エクステンションによって提供される OIDC クライアントフィルターを使用して、アクセストークンを取得および伝播します。

source: `RestClientWithTokenHeaderParam` REST client expects that the tokens will be passed to it as HTTP `Authorization` header values.
ja_jp: `RestClientWithTokenHeaderParam` REST クライアントは、トークンが HTTP `Authorization` ヘッダー値として渡されることを要求します。

source: `RestClientWithTokenHeaderParam`, which accepts a token already acquired by the programmatically created OidcClient as an HTTP `Authorization` header value.
ja_jp: `RestClientWithTokenHeaderParam`: これは、プログラムで作成された OidcClient によってすでに取得されたトークンを HTTP `Authorization` ヘッダー値として受け入れます。

source: `RestClientWithTokenPropagationFilter`, which uses an OIDC token propagation filter provided by the `quarkus-rest-client-oidc-token-propagation` extension to get and propagate an access token.
ja_jp: `RestClientWithTokenPropagationFilter`: これは、 `quarkus-rest-client-oidc-token-propagation` エクステンションによって提供される OIDC トークン伝播フィルターを使用して、アクセストークンを取得および伝播します。

source: `Retry/durationUnit` moves to `retry.max-duration-unit`
ja_jp: `Retry/durationUnit` は `retry.max-duration-unit` に

source: `Retry/jitterDelayUnit` moves to `retry.jitter-unit`
ja_jp: `Retry/jitterDelayUnit` は `retry.jitter-unit` に変更されます。

source: `Room` instances do not change during solving, so `Room` is also a _problem fact_.
ja_jp: 解決の間、 `Room` インスタンスは変更されないため、 `Room`も_問題の事実_です。

source: `Router` access is provided by the `quarkus-vertx-http` extension. If you use `quarkus-rest` or `quarkus-reactive-routes`, the extension will be added automatically.
ja_jp: `Router` アクセスは `quarkus-vertx-http` エクステンションによって提供されます。 `quarkus-rest` または `quarkus-reactive-routes` を使用すると、自動的にエクステンションが追加されます。

source: `Router` access is provided by the `quarkus-vertx-http` extension. If you use `quarkus-resteasy-reactive` or `quarkus-reactive-routes`, the extension will be added automatically.
ja_jp: `Router` アクセスは、 `quarkus-vertx-http` エクステンションにより指定されます。 `quarkus-resteasy-reactive` または `quarkus-reactive-routes` を使用すると、エクステンションが自動的に追加されます。

source: `Router` access is provided by the `quarkus-vertx-http` extension. If you use `quarkus-resteasy` or `quarkus-reactive-routes`, the extension will be added automatically.
ja_jp: `Router` アクセスは `quarkus-vertx-http` エクステンションによって提供されます。 `quarkus-resteasy` または `quarkus-reactive-routes` を使用すると、自動的にエクステンションが追加されます。

source: `RoutingExchange` is a convenient wrapper of `RoutingContext` which provides some useful methods.
ja_jp: `RoutingExchange` は、いくつかの便利なメソッドを提供する `RoutingContext` の便利なラッパーです。

source: `SNAKE_CASE` - The method name is derived by replacing case changes with an underscore to map the configuration property, i.e. `theHost` maps to `the_host`.
ja_jp: `SNAKE_CASE` - メソッド名は、大文字と小文字をアンダースコアで置き換えてコンフィギュレーション・プロパティに対応させることで派生します。つまり、 `theHost` は `the_host` に対応します。

source: `SNAKE_CASE` - The method name is derived by replacing case changes with an underscore to map the configuration property.
ja_jp: `SNAKE_CASE` - メソッド名は、設定プロパティをマッピングするためにケースの変更をアンダースコアで置き換えて導き出されます。

source: `SecurityIdentity` always represents the primary mTLS authentication when mTLS is used and an inclusive authentication is enabled.
ja_jp: mTLS が使用され、統合認証が有効になっている場合、 `SecurityIdentity` は常にプライマリー mTLS 認証を表します。

source: `SecurityIdentity` injection in Vert.x route handlers
ja_jp: `SecurityIdentity` の Vert.x ルートハンドラーへのインジェクション

source: `SecurityIdentity` permissions are mapped in the form of `io.quarkus.security.StringPermission` from the scope parameter of the <<token-claims-and-security-identity-roles,source of the roles>> and using the same claim separator.
ja_jp: `SecurityIdentity` 権限は、 `io.quarkus.security.StringPermission` の形式で、<<token-claims-and-security-identity-roles,source of the roles>> のスコープパラメーターから、同じクレームセパレーターを使用してマッピングされます。

source: `ServiceLoader` service files (the ones in `META-INF/services/`), used by the JDK and many libraries and frameworks to discover interface implementations;
ja_jp: JDK や多くのライブラリー、フレームワークがインターフェースの実装を見つけるために使用する `ServiceLoader` のサービスファイル (`META-INF/services/` 内のもの)。

source: `ServiceProviderBuildItem` takes a list of service implementation classes as parameters: if you are not reading them from the service file, make sure that they correspond to the service file contents because the service file will still be read and used at run-time. This is not a substitute for writing a service file.
ja_jp: `ServiceProviderBuildItem` は、サービス実装クラスのリストをパラメーターとして受け取ります。サービスファイルからそれらを読み取らない場合、それらがサービスファイルの内容に対応していることを確認してください。サービスファイルは、ランタイムで読み取られ、使用されるためです。これは、サービスファイルの書き込みに代わる手段ではありません。

source: `ServletBuildItem` proposes a fluent API to instantiate a Servlet named `greeting-extension` of type `GreetingExtensionServlet` (it's our class provided by our extension `runtime` module), and map it the `/greeting` path.
ja_jp: `ServletBuildItem` は、流暢な API を処理して `GreetingExtensionServlet` 型の `greeting-extension` というサーブレットをインスタンス化し (エクステンション `runtime` によって提供されるクラスです)、 `/greeting` パスにマッピングします。

source: `ServletBuildItem` proposes a fluent API to instantiate a Servlet named `greeting-extension` of type `GreetingExtensionServlet` (it's our class provided by our extension `runtime` module), and map it to the `/greeting` path.
ja_jp: `ServletBuildItem` は、`greeting-extension` という名前の `GreetingExtensionServlet` 型のサーブレット (これはエクステンションの `runtime` モジュールによって提供されるクラスです) をインスタンス化し、`/greeting` パスにマップするための流れるような API を提案します。

source: `ServletBuildItem`: describes a Servlet (name, path, etc.) we want to generate during the deployment.
ja_jp: `ServletBuildItem`: デプロイ時に生成したいサーブレット (名前、パスなど) を記述します。

source: `Session` (managed, blocking)
ja_jp: `Session` (マネージド、ブロッキング)

source: `StatelessSession` (stateless, blocking)
ja_jp: `StatelessSession` (ステートレス、ブロッキング)

source: `StereotypeRegistrarBuildItem` Example
ja_jp: `StereotypeRegistrarBuildItem` の例

source: `String` is replaced with `java.lang.String`: `{@java.util.List<java.lang.String> strings}`
ja_jp: String` は `java.lang.String` ( `{@java.util.List<java.lang.String> strings}`) に置き換えることができます。

source: `String` parameters annotated with `@PathParam`
ja_jp: `@PathParam` アノテーションが付けられた `String` パラメーター

source: `SunPKCS11` provider provides a bridge to specific `PKCS#11` implementations such as cryptographic smartcards and other Hardware Security Modules, Network Security Services in FIPS mode, etc.
ja_jp: `SunPKCS11` プロバイダーは、暗号化スマートカードやその他のハードウェアセキュリティモジュール、FIPSモードのネットワークセキュリティサービスなど、特定の `PKCS#11` 実装へのブリッジを提供します。

source: `SynthesisFinishedBuildItem` Example
ja_jp: `SynthesisFinishedBuildItem` の例

source: `SyntheticBeanBuildItem` Example 1
ja_jp: `SyntheticBeanBuildItem` の例 1

source: `SyntheticBeanBuildItem` Example 2
ja_jp: `SyntheticBeanBuildItem` の例 2

source: `SyntheticBeanBuildItem` Example 3
ja_jp: `SyntheticBeanBuildItem` の例 3

source: `Template.data()` returns a new template instance that can be customized before the actual rendering is triggered. In this case, we put the name value under the key `name`. The data map is accessible during rendering.
ja_jp: `Template.data()` は、実際のレンダリングがトリガーされる前にカスタマイズできる新しいテンプレートインスタンスを返します。この場合、名前の値をキー `name` の下に置きます。データマップはレンダリング中にアクセス可能です。

source: `Template.data(String, Object)` is a convenient method that creates a template instance and sets the data in one step.
ja_jp: `Template.data(String, Object)` は、ワンステップでテンプレートのインスタンスを作成してデータを設定する便利なメソッドです。

source: `TemplateExtension#ANY` Example
ja_jp: `TemplateExtension#ANY` の例

source: `TemplateExtension#matchName()` Example
ja_jp: `TemplateInstance.createUni()` の例

source: `TemplateExtension#matchNames()` Example
ja_jp: `TemplateInstance.createUni()` の例

source: `TemplateExtension#matchRegex()` Example
ja_jp: `TemplateInstance.createUni()` の例

source: `TemplateInstance.createMulti()` returns a new `Multi<String>` object. Each item represents a part/chunk of the rendered template. Again, `createMulti()` does not trigger rendering. Instead, every time a computation is triggered by a subscriber the template is rendered again.
ja_jp: `TemplateInstance.createMulti()` は新しい `Multi<String>` オブジェクトを返します。各アイテムはレンダリングされたテンプレートの一部/チャンクを表します。繰り返しになりますが、 `createMulti()` はレンダリングをトリガしません。代わりに、サブスクライバによって実行がトリガされるたびに、テンプレートが再びレンダリングされます。

source: `TemplateInstance.createMulti()` returns a new `Multi<String>` object. Each item represents a part/chunk of the rendered template. Again, `createMulti()` does not trigger rendering. Instead, every time a computation is triggered by a subscriber, the template is rendered again.
ja_jp: `TemplateInstance.createMulti()` は新しい `Multi<String>` オブジェクトを返します。 各アイテムはレンダリングされたテンプレートの一部/チャンクを表します。 繰り返しになりますが、`createMulti()` はレンダリングをトリガーしません。 代わりに、サブスクライバーによって計算がトリガーされるたびに、テンプレートが再びレンダリングされます。

source: `TemplateInstance.render()` triggers a synchronous rendering, i.e. the current thread is blocked until the rendering is finished. However, there are also asynchronous ways to trigger the rendering and consume the results. For example there is the `TemplateInstance.renderAsync()` method that returns `CompletionStage<String>` or `TemplateInstance.createMulti()` that returns Mutiny's `Multi<String>`.
ja_jp: `TemplateInstance.render()` は同期レンダリングをトリガーします。つまり、レンダリングが終了するまで現在のスレッドはブロックされます。しかし、レンダリングをトリガーして結果を消費する非同期のメソッドもあります。 例えば、 `CompletionStage<String>` を返す `TemplateInstance.renderAsync()` メソッドや、Mutiny の `Multi<String>` を返す `TemplateInstance.createMulti()` です。

source: `TemplateInstance.render()` triggers a synchronous rendering, i.e. the current thread is blocked until the rendering is finished. However, there are also asynchronous ways to trigger the rendering and consume the results. For example, there is the `TemplateInstance.renderAsync()` method that returns `CompletionStage<String>` or `TemplateInstance.createMulti()` that returns Mutiny's `Multi<String>`.
ja_jp: `TemplateInstance.render()` は、同期レンダリングをトリガーします。つまり、レンダリングが終了するまで現在のスレッドはブロックされます。しかし、レンダリングをトリガーして結果を消費する非同期のメソッドもあります。たとえば、`CompletionStage<String>` を返す `TemplateInstance.renderAsync()` メソッドや、Mutiny の `Multi<String> を返す `CompletionStage<String>` があります。

source: `TemplateInstance` provides several ways to trigger the rendering and consume the result. The most straightforward approach is represented by `TemplateInstance.render()`. This method triggers a synchronous rendering, i.e. the current thread is blocked until the rendering is finished, and returns the output. By contrast, `TemplateInstance.renderAsync()` returns a `CompletionStage<String>` which is completed when the rendering is finished.
ja_jp: `TemplateInstance` は、レンダリングをトリガーして結果を消費するためのいくつかの方法を提供しています。 最も簡単な方法は `TemplateInstance.render()` です。このメソッドは同期レンダリングをトリガーします。 つまり、レンダリングが終了するまで現在のスレッドをブロックして出力を返します。 対照的に、`TemplateInstance.renderAsync()` は `CompletionStage<String>` を返し、レンダリングが終了すると完了します。

source: `Templates.hello()` returns a new template instance that is returned from the resource method. Note that we don't trigger the rendering - this is done automatically by a special `ContainerResponseFilter` implementation provided by `quarkus-rest-qute`.
ja_jp: `Templates.hello()` は、リソースメソッドから返される新しいテンプレートインスタンスを返します。レンダリングはトリガーしないことに注意してください。これは、`quarkus-rest-qute` が提供する特別な `ContainerResponseFilter` 実装によって自動的に行われます。

source: `Templates.hello()` returns a new template instance that is returned from the resource method. Note that we don't trigger the rendering - this is done automatically by a special `ContainerResponseFilter` implementation.
ja_jp: `Templates.hello()` は、リソースメソッドから返される新しいテンプレートインスタンスを返します。 レンダリングをトリガーしないことに注意してください。これは、特別な `ContainerResponseFilter`実装によって自動的に行われます。

source: `TestResourceScope.GLOBAL`: Test resources apply to all tests in the test suite
ja_jp: `TestResourceScope.GLOBAL`: テストリソースはテストスイート内のすべてのテストに適用されます

source: `TestResourceScope.MATCHING_RESOURCES` (default): Quarkus will group tests with the same test resources and run them together. After a group has been executed, all test resources will be stopped, and the next group will be executed.
ja_jp: `TestResourceScope.MATCHING_RESOURCES` (デフォルト): Quarkus は同じテストリソースを持つテストをグループ化し、まとめてに実行します。グループが実行されると、すべてのテストリソースが停止され、次のグループが実行されます。

source: `TestResourceScope.RESTRICTED_TO_CLASS`: The test resource is available only for the annotated test class and will be stopped after the test class has been executed.
ja_jp: `TestResourceScope.RESTRICTED_TO_CLASS`: テストリソースは、アノテーションが付けられたテストクラスでのみ使用でき、テストクラスが実行されると停止されます。

source: `TestSecurity` annotation
ja_jp: `TestSecurity` アノテーション

source: `Testcontainers` will map these ports to random ports on the host. This avoids port conflicts, but presents a new problem – how do applications connect to the service in the container?
ja_jp: `Testcontainers` は、これらのポートをホスト上のランダムなポートにマッピングします。 これはポートの競合を回避しますが、コンテナ内のサービスにアプリケーションがどのように接続するかという新たな問題を引き起こします。
